tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "libpng"
brew "openssl@3"
brew "python@3.12"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "at-spi2-core"
brew "bat"
brew "cloudflared"
brew "curl"
brew "unixodbc"
brew "php"
brew "composer"
brew "diffutils"
brew "enchant"
brew "entr"
brew "exiftool"
brew "eza"
brew "gcc"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "gobject-introspection"
brew "gtk+3"
brew "gtk-mac-integration"
brew "gspell"
brew "libgedit-amtk"
brew "libxml2"
brew "libgedit-gtksourceview"
brew "py3cairo"
brew "pygobject3"
brew "libpeas"
brew "libsoup"
brew "tepl"
brew "gedit"
brew "gnu-time"
brew "go"
brew "gpp"
brew "guile"
brew "icdiff"
brew "jenkins"
brew "jq"
brew "lazygit"
brew "libomp", link: true
brew "libusb"
brew "neovim"
brew "node"
brew "opendetex"
brew "openjdk@17"
brew "pngpaste"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyqt@5"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "ruby@2.7"
brew "rust"
brew "subversion"
brew "swiftlint"
brew "tailwindcss", link: false
brew "wget"
brew "xdelta"
brew "youtube-dl"
brew "yt-dlp"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "mounty"
cask "wezterm"
cask "wine-stable"
